example/larceler/README.md
```mermaid
flowchart LR
evt-gen["GENIE
    prodgenie_nu_dune10kt_1x2x6.fcl"]
genie-data[("art::Event
    EventGen")]
det-edep["LArG4 + IonAndScint
    larg4_dune10kt_1x2x6.fcl"]
edep-data[("art::Event
    SimEnergyDeposit
    (label: IonAndScint)")]
det-optical-fast["Optical fast simulation
    opticalsim_dune10kt_1x2x6.fcl"]
det-optical-full["Celeritas optical transport
    opticalsim_celeritas_dune10kt_1x2x6.fcl"]
optical-data[("art::Event
    OpDetBackTrackerRecord
    (label: OpticalSim)")]
analyzer["PDSimAna (analyzer)
    pdsimana_job.fcl"]
analyzer-data[("analysis files")]

evt-gen --> genie-data --> det-edep --> edep-data
edep-data --> det-optical-fast & det-optical-full --> optical-data --> analyzer
analyzer --> analyzer-data
```
